Функция ОстатокТовараНаДату(Номенклатура, Склад, НаДату) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   ОстаткиТоваров.КоличествоОстаток КАК Остаток
    |ИЗ
    |   РегистрНакопления.ТоварыНаСкладах.Остатки(&НаДату, &НаДату, , Номенклатура = &Номенклатура И Склад = &Склад) КАК ОстаткиТоваров";
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("Склад", Склад);
    Запрос.УстановитьПараметр("НаДату", НаДату);
    Выборка = Запрос.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Остаток;
    КонецЕсли;
    Возврат 0;
КонецФункции